Revit 2026 API

# ConnectorCoefficient Property

---

The coefficient of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Coefficient { get; }
```
```vb
Public ReadOnly Property Coefficient As Double
	Get
```
```cpp
public:
property double Coefficient {
	double get ();
}
```
```fsharp
member Coefficient : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This connector does not support flow calculation and associated properties. |

Instantaneous coefficient of this connector, calculated according to system.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace